-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия сервера:               5.5.23 - MySQL Community Server (GPL)
-- ОС Сервера:                   Win32
-- HeidiSQL Версия:              9.3.0.4984
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- Дамп структуры базы данных lecar
CREATE DATABASE IF NOT EXISTS `lecar` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `lecar`;


-- Дамп структуры для таблица lecar.spravochnik
CREATE TABLE IF NOT EXISTS `spravochnik` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `Bolezn` varchar(50) NOT NULL,
  `Simptomi` varchar(50) NOT NULL,
  `Preparati` varchar(50) NOT NULL,
  `Dozirovka` int(11) NOT NULL,
  `Zamenyaemiepreparati` varchar(50) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы lecar.spravochnik: ~35 rows (приблизительно)
/*!40000 ALTER TABLE `spravochnik` DISABLE KEYS */;
INSERT INTO `spravochnik` (`id`, `Bolezn`, `Simptomi`, `Preparati`, `Dozirovka`, `Zamenyaemiepreparati`) VALUES
	(1, 'Конъюктивит', 'Воспаление слизистой глаза', 'Флюксал', 1, 'Заноцин'),
	(2, 'Конъюктивит', 'Покраснение глаза', 'Флюксал', 1, 'Макситрол'),
	(3, 'Конъюктивит', 'Боль в глазах', 'Макситрол', 2, 'Флюксал'),
	(4, 'Отомикоз', 'Заложенность уха', 'Пимафуцин', 3, 'Нитрофунгин'),
	(5, 'Отомикоз', 'Шум в ушах', 'Нитрофунгин', 2, 'Пимафуцин'),
	(6, 'Отомикоз', 'Боль  в ушах', 'Пимафуцин', 3, 'Нитрофунгин'),
	(7, 'Псориаз', 'Боль в суставах', 'Лемод', 2, 'Эсмидин'),
	(8, 'Псориаз', 'Кожный зуд', 'Стелара', 3, 'Лемод'),
	(9, 'Псориаз', 'Бляшки на коже', 'Лемод', 2, 'Эсмидин'),
	(10, 'Мигрень', 'Онемение конечностей', 'Новиган', 4, 'Панадол'),
	(11, 'Мигрень', 'Обморок', 'Диклавит', 3, 'Панадол'),
	(12, 'Мигрень', 'Пульсирующие головные боли', 'Диклавит', 3, 'Панадол'),
	(13, 'Мигрень', 'Судороги', 'Навиган', 2, 'Эсмидин'),
	(14, 'Кератит', 'Слезотечение', 'Флюксал', 1, 'Цикломед'),
	(15, 'Кератит', 'Снижение зрения', 'Гаразон', 2, 'Цикломед'),
	(16, 'Кератит', 'Покраснение роговицы', 'Цикломед', 2, 'Флюксал'),
	(17, 'Экзема', 'Сыпь', 'Акридем', 3, 'Фудицин'),
	(18, 'Экзема', 'Маленькие пузырьки', 'Акридем', 3, 'Фудицин'),
	(19, 'Бронхит', 'Сильный кашель', 'АЦЦ', 4, 'Мукалтин'),
	(20, 'Бронхит', 'Температура', 'Лазолван', 3, 'Мукалтин'),
	(21, 'Ангина', 'Боль в горле', 'Стопангин', 4, 'Зиннат'),
	(22, 'Ангина', 'Слабость', 'Стопангин', 4, 'Зинат'),
	(23, 'Ангина', 'Головная боль', 'Ципролет', 3, 'Стопангин'),
	(24, 'ОРВИ', 'Кашель', 'Ринза', 3, 'Кагоцел'),
	(25, 'ОРВИ', 'Температура', 'Арбидол', 3, 'Кагоцел'),
	(26, 'ОРВИ', 'Насморк', 'Ринза', 3, 'Кагоцел'),
	(27, 'Аллергия', 'Чихание', 'Супрастин', 2, 'Дексона'),
	(28, 'Аллергия', 'Покраснение и зуд кожи', 'Кларидол', 3, 'Дексона'),
	(29, 'Аллергия', 'Восполение глаз', 'Супрастин', 2, 'Дексона'),
	(30, 'Лабиринт', 'Нарушение слуха', 'Дексазон', 3, 'Гаразон'),
	(31, 'Лабиринт', 'Тошнота', 'Актипол', 2, 'Гаразон'),
	(32, 'Лабиринт', 'Рвота', 'Дексазон', 3, 'Гаразон'),
	(33, 'Грипп', 'Температура', 'Кагоцел', 3, 'Анаферон'),
	(34, 'Грипп', 'Озноб', 'Ринза', 2, 'Нурофен'),
	(35, 'Грипп', 'Слабость', 'Ринза', 2, 'Нурофен');
/*!40000 ALTER TABLE `spravochnik` ENABLE KEYS */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
